#+title: Visualize Keyboard Shortcuts for Emacs Commands
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

* Kanban

Here is a kanban of the features that will be (hopefully) added in due cours, and visually demonstrating their current status via a kanban board

#+begin_src emacs-lisp :results table :exports results :tangle no
(my/kanban-to-table "roadmap" "issues")
#+end_src

#+RESULTS:
| DOING                                                           | DONE                                                        |
|-----------------------------------------------------------------+-------------------------------------------------------------|
| Show random functions and their keybindings for learning        | Add transient like menu to activate different functionality |
| Fuzzy search on simple command description for Emacs transition |                                                             |
| Save keybindings that are discovered through random learning    |                                                             |
| Warning when keys in visualized command are not ergonomic       |                                                             |
| Key visualization to accomodate ergonomic keybinding setup      |                                                             |

* Customization

#+begin_src emacs-lisp :results table :colnames '("Custom variable" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^keyboard-visualizer-"
                                (symbol-name symbol))
                  (not (string-match "--" (symbol-name symbol)))
                  (or (custom-variable-p symbol)
                      (boundp symbol)))
         (push `(,symbol
                 ,(car
                   (split-string
                    (or (get (indirect-variable symbol)
                             'variable-documentation)
                        (get symbol 'variable-documentation)
                        "")
                    "\n")))
               rows))))
    rows)
#+end_src

#+RESULTS:
| Custom variable                         | Description                                                             |
|-----------------------------------------+-------------------------------------------------------------------------|
| keyboard-visualizer-query-command-map   | Mapping of natural language queries to Emacs commands.                  |
| keyboard-visualizer-show-documentation  | When non-nil, show command documentation in the keyboard layout buffer. |
| keyboard-visualizer-layout              | Keyboard layout.                                                        |
| keyboard-visualizer-ergonomic-indicator |                                                                         |
| keyboard-visualizer-insert-mode         |                                                                         |

